nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitINFRA_REDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitINFRA_REDPins(void)
{
    /* PCTLC Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Peripheral Crossbar Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_Xbar);

    const port_pin_config_t IR_TX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as PXBAR_OUT1 */
                                     kPORT_MuxAlt3,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTC2 (pin 21) is configured as PXBAR_OUT1 */
    PORT_SetPinConfig(BOARD_IR_TX_PORT, BOARD_IR_TX_PIN, &IR_TX);

    const port_pin_config_t IR_RX = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as CMP0P3 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTC3 (pin 22) is configured as CMP0P3 */
    PORT_SetPinConfig(BOARD_IR_RX_PORT, BOARD_IR_RX_PIN, &IR_RX);

    SIM->MISC_CTL = ((SIM->MISC_CTL &
                      /* Mask bits to zero which are setting */
                      (~(SIM_MISC_CTL_UARTMODTYPE_MASK | SIM_MISC_CTL_UART0IRSEL_MASK)))

                     /* UART Modulation Type: TypeB (ANDed) Modulation selected for IRDA. */
                     | SIM_MISC_CTL_UARTMODTYPE(MISC_CTL_UARTMODTYPE_0b1)

                     /* UART0 IRDA Select: UART0 selected for IRDA modulation.
                      * UART0 TX modulated by XBAR_OUT[14] and UART0 RX input connected to XBAR_OUT[13]. */
                     | SIM_MISC_CTL_UART0IRSEL(MISC_CTL_UART0IRSEL_0b1));
    /* CMP0 Output output assigned to XBAR_IN11 input is connected
     * to XBAR_OUT13 output assigned to UART Rx IrDA Input */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputCmp0Output, kXBAR_OutputUartRxInput);
    /* iRTC Clock Output output assigned to XBAR_IN10 input is connected
     * to XBAR_OUT14 output assigned to SIM UART Tx IrDA Modulator Carrier Input */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputRtcClockOutput, kXBAR_OutputUartTxModCarrier);
    /* UART TX Output (after modulation) output assigned to XBAR_IN14 input is connected
     * to XBAR_OUT18 output assigned to XBAR Output pin 1 */
    XBAR_SetSignalsConnection(XBAR, kXBAR_InputUartTxOutput, kXBAR_OutputXbOut1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPOTENTIOMETERPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '76', peripheral: ADC, signal: 'SE, 19', pin_signal: LCD8/AD10/PTG1/LLWU_P2/LPTIM0, slew_rate: no_init, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPOTENTIOMETERPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPOTENTIOMETERPins(void)
{
    /* PCTLG Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortG);

    /* PORTG1 (pin 76) is configured as AD10 */
    PORT_SetPinMux(BOARD_ADC_POT_PORT, BOARD_ADC_POT_PIN, kPORT_PinDisabledOrAnalog);

    PORTG->PCR[1] = ((PORTG->PCR[1] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding Port Pull Enable field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTEMP_SENSORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '67', peripheral: ADC, signal: 'SE, 16', pin_signal: AD7/PTF0/RTCCLKOUT/QT2/CMP0OUT/LLWU_P4, slew_rate: no_init, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTEMP_SENSORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTEMP_SENSORPins(void)
{
    /* PCTLF Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortF);

    /* PORTF0 (pin 67) is configured as AD7 */
    PORT_SetPinMux(BOARD_ADC_TEMP_PORT, BOARD_ADC_TEMP_PIN, kPORT_PinDisabledOrAnalog);

    PORTF->PCR[0] = ((PORTF->PCR[0] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pulldown resistor is enabled on the corresponding pin, if the
                      * corresponding Port Pull Enable field is set. */
                     | PORT_PCR_PS(kPORT_PullDown)

                     /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                     | PORT_PCR_PE(kPORT_PullDisable));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLCDPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '23', peripheral: LCD, signal: 'P, 43', pin_signal: LCD43/PTC4, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '17', peripheral: LCD, signal: 'P, 37', pin_signal: LCD37/CMP1P0/PTB6, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '16', peripheral: LCD, signal: 'P, 36', pin_signal: LCD36/PTB5, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '15', peripheral: LCD, signal: 'P, 35', pin_signal: LCD35/PTB4, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '14', peripheral: LCD, signal: 'P, 34', pin_signal: LCD34/PTB3, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '13', peripheral: LCD, signal: 'P, 33', pin_signal: LCD33/PTB2, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '12', peripheral: LCD, signal: 'P, 32', pin_signal: LCD32/PTB1, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '9', peripheral: LCD, signal: 'P, 31', pin_signal: LCD31/PTB0, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '6', peripheral: LCD, signal: 'P, 28', pin_signal: LCD28/PTA5/CMP0OUT, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '5', peripheral: LCD, signal: 'P, 27', pin_signal: LCD27/PTA4/LLWU_P15/NMI_B, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '4', peripheral: LCD, signal: 'P, 26', pin_signal: LCD26/PTA3, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '3', peripheral: LCD, signal: 'P, 25', pin_signal: LCD25/PTA2, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '2', peripheral: LCD, signal: 'P, 24', pin_signal: LCD24/PTA1, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '1', peripheral: LCD, signal: 'P, 23', pin_signal: LCD23/PTA0, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '94', peripheral: LCD, signal: 'P, 22', pin_signal: LCD22/PTI3, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '93', peripheral: LCD, signal: 'P, 21', pin_signal: LCD21/PTI2, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '88', peripheral: LCD, signal: 'P, 20', pin_signal: LCD20/PTH5, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '87', peripheral: LCD, signal: 'P, 19', pin_signal: LCD19/PTH4, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '86', peripheral: LCD, signal: 'P, 18', pin_signal: LCD18/PTH3, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '85', peripheral: LCD, signal: 'P, 17', pin_signal: LCD17/PTH2, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '84', peripheral: LCD, signal: 'P, 16', pin_signal: LCD16/PTH1, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '83', peripheral: LCD, signal: 'P, 15', pin_signal: LCD15/PTH0, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '82', peripheral: LCD, signal: 'P, 14', pin_signal: LCD14/PTG7, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '81', peripheral: LCD, signal: 'P, 13', pin_signal: LCD13/PTG6/LLWU_P0/LPTIM2, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '80', peripheral: LCD, signal: 'P, 12', pin_signal: LCD12/PTG5/SPI0_MISO/LPTIM1, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '79', peripheral: LCD, signal: 'P, 11', pin_signal: LCD11/PTG4/SPI0_MOSI/I2C0_SDA, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '78', peripheral: LCD, signal: 'P, 10', pin_signal: LCD10/PTG3/SPI0_SCK/I2C0_SCL, slew_rate: fast, pull_select: down, pull_enable: disable}
  - {pin_num: '77', peripheral: LCD, signal: 'P, 9', pin_signal: LCD9/AD11/PTG2/SPI0_SS_B/LLWU_P1, slew_rate: fast, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

