nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLCDPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLCDPins(void)
{
    /* PCTLA Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* PCTLB Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* PCTLC Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* PCTLG Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortG);
    /* PCTLH Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortH);
    /* PCTLI Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortI);

    const port_pin_config_t LCD23 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD23 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA0 (pin 1) is configured as LCD23 */
    PORT_SetPinConfig(BOARD_LCD23_PORT, BOARD_LCD23_PIN, &LCD23);

    const port_pin_config_t LCD24 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD24 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA1 (pin 2) is configured as LCD24 */
    PORT_SetPinConfig(BOARD_LCD24_PORT, BOARD_LCD24_PIN, &LCD24);

    const port_pin_config_t LCD25 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD25 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA2 (pin 3) is configured as LCD25 */
    PORT_SetPinConfig(BOARD_LCD25_PORT, BOARD_LCD25_PIN, &LCD25);

    const port_pin_config_t LCD26 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD26 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA3 (pin 4) is configured as LCD26 */
    PORT_SetPinConfig(BOARD_LCD26_PORT, BOARD_LCD26_PIN, &LCD26);

    const port_pin_config_t LCD27 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD27 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA4 (pin 5) is configured as LCD27 */
    PORT_SetPinConfig(BOARD_LCD27_PORT, BOARD_LCD27_PIN, &LCD27);

    const port_pin_config_t LCD28 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD28 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTA5 (pin 6) is configured as LCD28 */
    PORT_SetPinConfig(BOARD_LCD28_PORT, BOARD_LCD28_PIN, &LCD28);

    const port_pin_config_t LCD31 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD31 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB0 (pin 9) is configured as LCD31 */
    PORT_SetPinConfig(BOARD_LCD31_PORT, BOARD_LCD31_PIN, &LCD31);

    const port_pin_config_t LCD32 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD32 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB1 (pin 12) is configured as LCD32 */
    PORT_SetPinConfig(BOARD_LCD32_PORT, BOARD_LCD32_PIN, &LCD32);

    const port_pin_config_t LCD33 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD33 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB2 (pin 13) is configured as LCD33 */
    PORT_SetPinConfig(BOARD_LCD33_PORT, BOARD_LCD33_PIN, &LCD33);

    const port_pin_config_t LCD34 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD34 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB3 (pin 14) is configured as LCD34 */
    PORT_SetPinConfig(BOARD_LCD34_PORT, BOARD_LCD34_PIN, &LCD34);

