nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.c
    const port_pin_config_t LCD35 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD35 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB4 (pin 15) is configured as LCD35 */
    PORT_SetPinConfig(BOARD_LCD35_PORT, BOARD_LCD35_PIN, &LCD35);

    const port_pin_config_t LCD36 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD36 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB5 (pin 16) is configured as LCD36 */
    PORT_SetPinConfig(BOARD_LCD36_PORT, BOARD_LCD36_PIN, &LCD36);

    const port_pin_config_t LCD37 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD37 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB6 (pin 17) is configured as LCD37 */
    PORT_SetPinConfig(BOARD_LCD37_PORT, BOARD_LCD37_PIN, &LCD37);

    const port_pin_config_t LCD43 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD43 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTC4 (pin 23) is configured as LCD43 */
    PORT_SetPinConfig(BOARD_LCD43_PORT, BOARD_LCD43_PIN, &LCD43);

    const port_pin_config_t LCD9 = {/* Internal pull-up/down resistor is disabled */
                                    kPORT_PullDisable,
                                    /* Fast slew rate is configured */
                                    kPORT_FastSlewRate,
                                    /* Pin is configured as LCD9 */
                                    kPORT_PinDisabledOrAnalog,
                                    /* Pin Control Register fields [15:0] are not locked */
                                    kPORT_UnlockRegister};
    /* PORTG2 (pin 77) is configured as LCD9 */
    PORT_SetPinConfig(BOARD_LCD9_PORT, BOARD_LCD9_PIN, &LCD9);

    const port_pin_config_t LCD10 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD10 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTG3 (pin 78) is configured as LCD10 */
    PORT_SetPinConfig(BOARD_LCD10_PORT, BOARD_LCD10_PIN, &LCD10);

    const port_pin_config_t LCD11 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD11 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTG4 (pin 79) is configured as LCD11 */
    PORT_SetPinConfig(BOARD_LCD11_PORT, BOARD_LCD11_PIN, &LCD11);

    const port_pin_config_t LCD12 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD12 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTG5 (pin 80) is configured as LCD12 */
    PORT_SetPinConfig(BOARD_LCD12_PORT, BOARD_LCD12_PIN, &LCD12);

    const port_pin_config_t LCD13 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD13 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTG6 (pin 81) is configured as LCD13 */
    PORT_SetPinConfig(BOARD_LCD13_PORT, BOARD_LCD13_PIN, &LCD13);

    const port_pin_config_t LCD14 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD14 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTG7 (pin 82) is configured as LCD14 */
    PORT_SetPinConfig(BOARD_LCD14_PORT, BOARD_LCD14_PIN, &LCD14);

