nxp-mcuxpresso/mcuxsdk-examples/_boards/twrkm34z50mv3/common/pin_mux/pin_mux.c
    const port_pin_config_t LCD15 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD15 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH0 (pin 83) is configured as LCD15 */
    PORT_SetPinConfig(BOARD_LCD15_PORT, BOARD_LCD15_PIN, &LCD15);

    const port_pin_config_t LCD16 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD16 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH1 (pin 84) is configured as LCD16 */
    PORT_SetPinConfig(BOARD_LCD16_PORT, BOARD_LCD16_PIN, &LCD16);

    const port_pin_config_t LCD17 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD17 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH2 (pin 85) is configured as LCD17 */
    PORT_SetPinConfig(BOARD_LCD17_PORT, BOARD_LCD17_PIN, &LCD17);

    const port_pin_config_t LCD18 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD18 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH3 (pin 86) is configured as LCD18 */
    PORT_SetPinConfig(BOARD_LCD18_PORT, BOARD_LCD18_PIN, &LCD18);

    const port_pin_config_t LCD19 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD19 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH4 (pin 87) is configured as LCD19 */
    PORT_SetPinConfig(BOARD_LCD19_PORT, BOARD_LCD19_PIN, &LCD19);

    const port_pin_config_t LCD20 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD20 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTH5 (pin 88) is configured as LCD20 */
    PORT_SetPinConfig(BOARD_LCD20_PORT, BOARD_LCD20_PIN, &LCD20);

    const port_pin_config_t LCD21 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD21 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTI2 (pin 93) is configured as LCD21 */
    PORT_SetPinConfig(BOARD_LCD21_PORT, BOARD_LCD21_PIN, &LCD21);

    const port_pin_config_t LCD22 = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Pin is configured as LCD22 */
                                     kPORT_PinDisabledOrAnalog,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTI3 (pin 94) is configured as LCD22 */
    PORT_SetPinConfig(BOARD_LCD22_PORT, BOARD_LCD22_PIN, &LCD22);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
